import titanic from "./img/titanic.jpg"
import Do from "./img/doStrechi.jpg"
import dune from "./img/Dune.jpg"
import sub from "./img/substan.jpg"
import love from "./img/love.jpg"
import op from "./img/Oppenheimer.jpg"
import master from "./img/master.jpg"
import gr from "./img/граф.jpg"
import hat from "./img/hatico.jpg"
import noj from "./img/Dostat.jpg"
import volk from "./img/Волк.jpg"
import anora from "./img/Анора.jpg"
import djoker from "./img/Джокер.jpg"
import mather from "./img/Материнский инстинкт.jpg"
import glodiyatr from "./img/глодиятор.jpg"
import brother from "./img/брат.jpg"
import { background } from "@salutejs/plasma-tokens"



export const drama = [
    {
        id:1,
        img: titanic,
        title:"Титаник",
        janr:"мелодрама, история, триллер, драма",
        backgroundImg:titanic,
        title2:"В первом и последнем плавании шикарного «Титаника» встречаются двое. Пассажир нижней палубы Джек выиграл билет в карты, а богатая наследница Роза отправляется в Америку, чтобы выйти замуж по расчёту. Чувства молодых людей только успевают расцвести, и даже не классовые различия создадут испытания влюблённым, а айсберг, вставший на пути считавшегося непотопляемым лайнера.",
        rating:9.2,
        duration:"2ч 10мин"

    },
    {
        id:2,
        img:Do,
        title:"До встречи с тобой",
        janr:"романтика,  драма",
        backgroundImg:Do,
        title2:"26-летней Лу известно, сколько идти до ближайшей остановки. Ей известно, что работа в кафе — это здорово, а Патрику уже давно пора дать от ворот поворот. Однако ей не известно, что она близка к потере работы и что в следующие месяцы груз проблем станет так велик, что выдержать его будет почти невозможно.",
        rating:6.2,
        duration:"1ч 10мин"
    },
    {
        id:3,
        img:dune,
        title:"Дюна ",
        janr:"фантастика, боевик, драма, приключения",
        backgroundImg:dune,
        title2:"Фильм, основанный на одноимённом фантастическом романе Френка Герберта, расскажет историю Пола Атрейдеса — талантливого молодого человека, рождённого в состоятельной семье. Ему суждено великое будущее, которое он пока не в силах осознать. Однажды его семейство отправляют на далёкую и опасную планету Арракис, где среди бесконечных песчаных дюн добывают специю — психоделическое вещество, необходимое для межгалактических путешествий. Добыче мешают жуткие существа — огромные песчаные черви, реагирующие на звук и пожирающие всё на своём пути. Пока Атрейдесы осваиваются на планете, они не догадываются, что их отправили на верную смерть...",
        rating:7.8,
        duration:"2ч 40мин"
    },
    {
        id:4,
        img:sub,
        title:"Субстанция",
        janr:"ужасы, драма",
        backgroundImg:sub,
        title2:"Увядающая голливудская звезда Элизабет Спаркл отчаянно пытается оставаться на плаву в любимой профессии. Однако лучшие дни Элизабет давно миновали, и теперь она ведет фитнес-программу на телевидении. Но однажды руководство решает, что ее время вышло, и предлагает актрисе отправиться на пенсию. Это становится тяжелым ударом для Спаркл, которая не желает мириться со своей участью, мечтая вернуть молодость. И вскоре она неожиданно получает такую",
        rating:6.9,
        duration:"1ч 40мин"
    },
    {
        id:5,
        img:love,
        title:"Любовь Советского Союза",
        janr:"драма",
        backgroundImg:love,
        title2:"Фильм о поколении смелых и красивых, не заставших разрушений революции и хаоса гражданской войны, мечтавших построить новую жизнь, в которой не будет места смерти, а только невероятной любви, открывающей им путь к великим достижениям и открытиям. О подвигах и славе, предательстве и верности тех, кто был героями в небе и на земле. О времени безмерных испытаний, которые выпали на их недолгие, но яркие жизни. О женщине, которая была мечтой и настоящей любовью Советского Союза.",
        rating:9.2,
        duration:"1ч 50мин"
    },
    {
        id:6,
        img:op,
        title:"Оппенгеймер ",
        janr:"биография, драма, история",
        backgroundImg:op,
        title2:"История жизни американского физика-теоретика Роберта Оппенгеймера, который во времена Второй мировой войны руководил Манхэттенским проектом — секретными разработками ядерного оружия.",
        rating:9.6,
        duration:"2ч 50мин"
        
    },
    {
        id:7,
        img:master,
        title:"Мастер и Маргарита",
        janr:"драма, фэнтези, мелодрама",
        backgroundImg:master,
        title2:"Москва, 1930-е годы. Популярный драматург обвиняется в антисоветчине: спектакль по его пьесе отменяют, а самого его выгоняют из союза литераторов. В не самый лучший момент своей жизни он встречает глубоко несчастную в браке красавицу Маргариту и начинает новый роман, героями которого становятся люди из его окружения, в том числе — мистический персонаж Воланд, списанный со знакомого иностранца.",
        rating:5.1,
        duration:"1ч 34мин"
    },
    {
        id:8,
        img:gr,
        title:"Граф Монте-Кристо ",
        janr:"триллер, драма, мелодрама",
        backgroundImg:gr,
        title2:"1815 год. В день свадьбы с возлюбленной молодого капитана дальнего плавания Эдмона Дантеса по лживому доносу и несправедливому обвинению в государственной измене без суда и следствия отправляют в одну из самых страшных тюрем — в замок Иф. После 4 лет заключения в тюрьме он встречает ещё одного узника — аббата Фариа, который пытается прорыть тоннель для побега. Став помощником Фариа, Дантес узнает от него о месте, где спрятаны несметные богатства ордена тамплиеров. Спустя 10 лет, совершив побег и добравшись до сокровищ, Дантес становится загадочным графом Монте-Кристо и начинает воплощать хитроумный план мести, чтобы покарать тех, кто сломал ему жизнь.",
        rating:4.8,
        duration:"1ч 10мин"

    },
    {
        id:9,
        img:hat,
        title:"Хатико: Самый верный друг",
        janr:"драма, семейный, биография",
        backgroundImg:hat,
        title2:"Однажды, возвращаясь с работы, профессор колледжа нашел на вокзале симпатичного щенка породы акита-ину. Профессор и Хатико стали верными друзьями. Каждый день пес провожал и встречал хозяина на вокзале.",
        rating:6.9,
        duration:"1ч 45мин"

    },
    {
        id:10,
        img:noj,
        title:"Достать ножи",
        janr:"детектив, комедия, драма, криминал",
        backgroundImg:noj,
        title2:"На следующее утро после празднования 85-летия известного автора криминальных романов Харлана Тромби виновника торжества находят мёртвым. Налицо — явное самоубийство, но полиция по протоколу опрашивает всех присутствующих в особняке членов семьи, хотя, в этом деле больше заинтересован частный детектив Бенуа Блан. Тем же утром он получил конверт с наличными от неизвестного и заказ на расследование смерти Харлана. Не нужно быть опытным следователем, чтобы понять, что все приукрашивают свои отношения с почившим главой семейства, но Блану достаётся настоящий подарок — медсестра покойного, которая физически не выносит ложь.",
        rating:5.2,
        duration:"1ч 50мин"
    },
    {
        id:11,
        img:volk,
        title:"Волк с Уолл-стрит",
        janr:"драма, криминал, биография, комедия",
        backgroundImg:volk,
        title2:"1987 год. Джордан Белфорт становится брокером в успешном инвестиционном банке. Вскоре банк закрывается после внезапного обвала индекса Доу-Джонса. По совету жены Терезы Джордан устраивается в небольшое заведение, занимающееся мелкими акциями. Его настойчивый стиль общения с клиентами и врождённая харизма быстро даёт свои плоды. Он знакомится с соседом по дому Донни, торговцем, который сразу находит общий язык с Джорданом и решает открыть с ним собственную фирму. В качестве сотрудников они нанимают нескольких друзей Белфорта, его отца Макса и называют компанию «Стрэттон Оукмонт». В свободное от работы время Джордан прожигает жизнь: лавирует от одной вечеринки к другой, вступает в сексуальные отношения с проститутками, употребляет множество наркотических препаратов, в том числе кокаин и кваалюд. Однажды наступает момент, когда быстрым обогащением Белфорта начинает интересоваться агент ФБР...",
        rating:7.3,
        duration:"2ч 43мин"
    },
    {
        id:12,
        img:anora,
        title:"Анора",
        janr:"драма, мелодрама, комедия",
        backgroundImg:anora,
        title2:"Бруклин. Стриптизерша Анора, предпочитающая имя Эни, знакомится с сыном русского олигарха Ваней, который проводит всё время в вечеринках и развлечениях. Вскоре парень выкупает время Эни на неделю, предлагает слетать в Вегас, а там молодые люди спонтанно женятся. Узнав об этом из газет, родители Вани приходят в ярость и срочно вылетают из России в США, а разобраться в ситуации велят нью-йоркскому армянину Торосу, который должен был присматривать за их сыном.",
        rating:7.8,
        duration:"1ч 20мин"
        
    },
    {
        id:13,
        img:djoker,
        title:"Джокер",
        janr:"драма, криминал, триллер",
        backgroundImg:djoker,
        title2:"Готэм, начало 1980-х годов. Комик Артур Флек живет с больной матерью, которая с детства учит его «ходить с улыбкой». Пытаясь нести в мир хорошее и дарить людям радость, Артур сталкивается с человеческой жестокостью и постепенно приходит к выводу, что этот мир получит от него не добрую улыбку, а ухмылку злодея Джокера.",
        rating:2.1,
        duration:"1ч 23мин"

    },
    {
        id:14,
        img:mather,
        title:"Материнский инстинкт",
        janr:"Драма, триллер",
        backgroundImg:mather,
        title2:"Начало 1960-х, американский пригород. Элис и Селин — лучшие подруги. Они живут в соседних домах, их сыновья учатся в одном классе и растут как братья, а знаменательные даты две семьи отмечают вместе. Но этой идиллии приходит конец после несчастного случая. Дружба женщин трещит по швам и оборачивается взаимными подозрениями и упрёками.",
        rating:5.9,
        duration:"1ч 34мин"
    },
    {
        id:14,
        img:glodiyatr,
        title:"Гладиатор II",
        janr:"боевик, драма, история",
        backgroundImg:glodiyatr,
        title2:"200 год нашей эры. Армия Римской империи под командованием генерала Марка Акация штурмует Нумидию — последнее свободное государство в Северной Африке. В битве с захватчиками у воина Ханно погибает супруга-лучница, а сам он попадает в плен. Вместе с другими пленниками его готовятся продать в рабство, но благодаря физической выносливости и боевым навыкам его замечает и покупает организатор гладиаторских боёв Макрин. Так воин становится гладиатором, одержимым жаждой мести римскому полководцу. Макрин обещает Ханно устроить встречу с его заклятым врагом, если парень будет эффектно, красочно и яростно сражаться на арене Колизея.",
        rating:7.8,
        duration:"1ч 56мин"
    },
    {
        id:15,
        img:brother,
        title:"Брат",
        janr:"драма, криминал, боевик",
        backgroundImg:brother,
        title2:"Демобилизовавшись, Данила Багров возвращается в родной городок. Но скучная жизнь провинции его не устраивает, и он отправляется в Петербург, где, по слухам, уже несколько лет процветает его старший брат. Данила находит брата, но всё оказывается не так просто — брат работает наемным убийцей.",
        rating:8.9,
        duration:"1ч 12мин"
    },
]
