import { title } from "framer-motion/client"
import dom from "./img/домовой.jpg"
import chuj from "./img/чужой.jpg"
import nasverot from "./img/неверату.jpg"
import sak from "./img/Проклятие.jpg"
import ujas from "./img/ужасающий.jpg"
import tih from "./img/тихое место.jpg"
import ast from "./img/астрал.jpg"
import ebi from "./img/ебигейл.jpg"
import ul from "./img/Улыбка.jpg"
import taro from "./img/Таро.jpg"
import ap from "./img/Апокалипсис.jpg"
import per from "./img/первобытное.jpg"
import baba from "./img/бабадук.jpg"
import mama from "./img/mama.jpg"
import pusan from "./img/pusan.jpeg"
import svon from "./img/звонок.jpeg"


export const horror = [
    {
        id: 1,
        img: dom,
        title: "Домовой",
        janr: "ужасы, фэнтези",
        backgrounImg: dom,
        title2: "Осиротев, Варя и Арсений перебираются из родной деревни в дом к приемным родителям. Но надежда на счастливую жизнь угасает, когда им бросает вызов древняя потусторонняя сила.",
        rating: 7.5,
        duration: "1ч 45мин",
        releaseDate: "2024-03-15"
    },
    {
        id: 2,
        img: chuj,
        title: "Чужой: Ромул",
        janr: "ужасы, фантастика, боевик",
        backgrounImg: chuj,
        title2: "Середина XXII века. На колонизированной планете Звезда Джексона никогда не восходит солнце, и почти всё население работает в шахтах. Девушка Рэйн с андроидом Энди, которого она называет братом, собиралась переехать на другую планету, но корпорация в одностороннем порядке продлила её контракт ещё на пять лет. Возможность сбежать появляется, когда компания друзей Рэйн решает проникнуть на пролетающий мимо заброшенный космический корабль с необходимым для длительного путешествия оборудованием.",
        rating: 8.0,
        duration: "2ч 10мин",
        releaseDate: "2024-04-20"
    },
    {
        id: 3,
        img: nasverot,
        title: "Носферату",
        janr: "ужасы",
        backgrounImg: nasverot,
        title2: "Вюрцбург, 1838 год. Несмотря на дурное предчувствие жены Эллен, с детства одолеваемой видениями, ради продвижения по службе Томас отправляется на восток Богемии, чтобы закрыть сделку о продаже недвижимости эксцентричному старому князю Орлоку. Мужчина становится пленником коварного князя, который оказывается кровососущей нежитью, а тем временем недуг Эллен всё больше походит на одержимость.",
        rating: 7.8,
        duration: "1ч 55мин",
        releaseDate: "2024-05-10"
    },
    {
        id: 4,
        img: sak,
        title: "Проклятие «Зов могилы»",
        janr: "ужасы",
        backgrounImg: sak,
        title2: "Проживающая в Лос-Анджелесе богатая семья корейского происхождения узнаёт, что страдает от духа разгневанного предка. Шаманка, её помощник, эксперт по фэншуй и владелец похоронной фирмы в Корее должны извлечь из могилы гроб с телом прадеда и, не вскрывая, кремировать его как можно быстрее. Однако жадный сотрудник больницы, куда привезли останки на временное хранение, поверив слухам о спрятанных там сокровищах, открывает гроб, что приводит к ужасающим последствиям.",
        rating: 7.2,
        duration: "1ч 50мин",
        releaseDate: "2024-06-01"
    },
    {
        id: 5,
        img: ujas,
        title: "Ужасающий 3",
        janr: "ужасы",
        backgrounImg: ujas,
        title2: "Пять лет назад адский клоун-маньяк Арт восстал из мёртвых, выкрал из психлечебницы Викторию и заснул. А Сиенна, проведя эти годы в специализированном учреждении, собирается встретить Рождество с семьёй тёти. Она обожает младшую двоюродную сестру и рада находиться в кругу родни, но страшные видения не отпускают девушку. Как раз в это время незадачливые рабочие пробуждают Арта и демона, вселившегося в изуродованное тело Виктории, — так порождения тьмы отправляются наводить рождественскую суету среди ничего не подозревающих жителей округа Майлз.",
        rating: 6.9,
        duration: "1ч 40мин",
        releaseDate: "2024-07-15"
    },
    {
        id: 6,
        img: tih,
        title: "Тихое место: День первый",
        janr: "ужасы, фантастика, драма",
        backgrounImg: tih,
        title2: "Сэм, терминальная пациентка хосписа в пригороде Нью-Йорка, вместе с группой других больных отправляется на Манхэттен в кукольный театр. Когда это представление подходит к концу, начинается новое: Землю атакуют полчища инопланетных чудовищ, которые ничего не видят, но все слышат. Сэм решает не бегать попусту и напоследок сходить в родной Гарлем за пиццей. По дороге кот Фродо, всюду ее сопровождающий, знакомится с насмерть перепуганным студентом-юристом из Англии.",
        rating: 8.1,
     
        duration: "1ч 50мин",
        releaseDate: "2024-08-20"
    },
    {
        id: 7,
        img: ast,
        title: "Астрал. Медиум",
        janr: "ужасы, фэнтези",
        backgrounImg: ast,
        title2: "Дани была жестоко убита в собственном доме. Год спустя её сестра-близнец — слепая медиум Дарси — приезжает в тот самый дом, где её бывший зять живёт уже с новой пассией, чтобы выяснить все подробности произошедшего.",
        rating: 7.4,
        duration: "1ч 55мин",
        releaseDate: "2024-09-05"
    },
    {
        id: 8,
        img: ebi,
        title: "Эбигейл",
        janr: "ужасы",
        backgrounImg: ebi,
        title2: "Банда наёмников по наводке похищает 12-летнюю балерину, дочь некоего богатого человека. Засев в уединённом особняке, они в течение 24 часов собираются ожидать выкуп, когда вдруг кто-то начинает сокращать их количество.",
        rating: 7.0,
        duration: "1ч 45мин",
        releaseDate: "2024-10-10"
    },
    {
        id: 9,
        img: ul,
        title: "Улыбка 2",
        janr: "ужасы",
        backgrounImg: ul,
        title2: "Джоэл избавился от проклятья, передав его случайному свидетелю убийства двух наркоторговцев. Несколько дней спустя поп-звезда Скай, которая готовится к возвращению на сцену после годового перерыва, не в силах терпеть боль в спине отправляется к знакомому дилеру. Тот ведёт себя странно, сильно напуган и вдруг, дико улыбаясь, забивает себя до смерти блином от штанги. Теперь, в самое неподходящее время — перед большим турне, когда Скай нужно репетировать и посещать мероприятия, — девушку начинают сводить с ума галлюцинации и жуткие улыбки.",
        rating: 6.8,
        duration: "1ч 50мин",
        releaseDate: "2024-11-15"
    },
    {
        id: 10,
        img: taro,
        title: "Таро: Карта смерти",
        janr: "ужасы, фэнтези",
        backgrounImg: taro,
        title2: "Компания студентов снимает на выходные дом, где находит старинную колоду карт Таро. Погадав на них, уже на следующий день ребята обнаруживают, что предсказания начинают сбываться, а вскоре за каждым из них придут старшие арканы, выпавшие последними.",
        rating: 7.1,
        duration: "1ч 40мин",
        releaseDate: "2024-12-01"
    },
    {
        id: 11,
        img: ap,
        title: "Апокалипсис Z: Начало конца",
        janr: "ужасы, фантастика, боевик, триллер",
        backgrounImg: ap,
        title2: "После смерти жены Манель живет с котом и изредка общается с сестрой по видеосвязи. Тем временем в Европе распространяется вирус, который превращает людей в агрессивных зомби. Поначалу Манель сидит дома, но вскоре недостаток припасов заставляет его выйти в город, где ему предстоит бороться за выживание.",
        duration: "2ч 05мин",
        releaseDate: "2024-12-20"
    },
    {
        id: 12,
        img: per,
        title: "Первобытное зло",
        janr: "ужасы, боевик",
        backgrounImg: per,
        title2: "Этот серийный убийца скрывается в африканских джунглях и считается одним из самых опасных. На его счету больше жертв, чем у Джека-Потрошителя, Унабомбера и Чикатило вместе взятых. Его много раз пытались поймать, но каждый раз преследователи в лучшем случае уходили ни с чем, а в худшем – сами становились новыми жертвами. Команда телевизионщиков из США отправляется в африканские джунгли, чтобы снять сюжет о поисках легендарного киллера, но они не предполагают, с каким первобытным злом им придётся столкнуться.",
        rating: 6.5,
        duration: "1ч 50мин",
        releaseDate: "2007-10-12"
    },
    {
        id: 13,
        img: baba,
        title: "Бабадук",
        janr: "драма, ужасы, фэнтези",
        backgrounImg: baba,
        title2: "Шесть лет назад Амелия в один день потеряла мужа и родила сына. Сэмуэлю идёт уже седьмой год, но ему везде мерещатся чудовища. Однажды перед сном мальчик просит маму почитать ему найденную книгу об ужасном монстре. С этого момента его страхи получают физическое воплощение в жутком Бабадуке.",
        rating: 7.7,
        duration: "1ч 35мин",
        releaseDate: "2014-08-22"
    },
    {
        id: 14,
        img: mama,
        title: "мама!",
        janr: "детектив, драма, триллер, ужасы",
        backgrounImg: mama,
        title2: "Отношения молодой пары оказываются под угрозой, когда, нарушая безмятежное существование супругов, в их дом заявляются незваные гости.",
        rating: 7.3,
        duration: "2ч 01мин",
        releaseDate: "2017-09-15"
    },
    {
        id: 15,
        img: pusan,
        title: "Поезд в Пусан",
        janr: "боевик, триллер, ужасы",
        backgrounImg: pusan,
        title2: "У маленькой Су-ан день рождения. Девочка живет с отцом в Сеуле и очень хочет отправиться к маме в Пусан. По дороге случается непредвиденное, и на страну обрушивается загадочный вирус. Пассажирам поезда в Пусан — единственного города, отразившего атаки вируса — придется бороться за выживание. 442 километра в пути. Добро пожаловать на борт и помните — в этой гонке недостаточно выжить, чтобы остаться человеком.",
        rating: 8.2,
        duration: "1ч 58мин",
        releaseDate: "2016-07-20"
    },
    {
        id: 16,
        img: svon,
        title: "Звонок",
        janr: "детектив, ужасы",
        backgrounImg: svon,
        title2: "Телефонный звонок раздаётся после просмотра некой загадочной видеокассеты. Жертве даётся ровно семь дней, а после следует неминуемая смерть. Журналистка Рэйчел расследует загадочные смерти молодых людей, и случайно кассета-убийца попадает в руки к её маленькому сыну, над которым теперь нависает смертельная угроза. У женщины есть только семь дней, чтобы разобраться в происходящем и спасти своего мальчика.",
        rating: 7.9,
        duration: "1ч 55мин",
        
    },
];