import { img, title } from "framer-motion/client"
import salam from "./img/salam.jpg"
import aijam from "./img/айжамал.jpg"
import inma from "./img/в поисках мамы.jpg"
import poj from "./img/pojil.jpg"
import rez from "./img/petz.jpg"
import one from "./img/один дома.jpg"
import chil from "./img/children.jpg"
import djin from "./img/джин.jpg"
import джингыл from "./img/джингыл.jpg"
import live from "./img/live.jpg"
import you from "./img/you.jpg"
import kas from "./img/каскадеры.jpeg"
import pad from "./img/пад.jpg"
import son from "./img/соник.jpg"
import fath from "./img/father.jpg"
import holop from "./img/holop.jpg"

export const komediya =[
    {
        id:1,
        img:salam,
        title:"Салам, New York",
        janr:"комедия, драма, мелодрама",
        backgrounImg:salam,
        title2:"Баатыр Аманов прилетает в Нью-Йорк для учёбы в колумбийском университете. Толком не знающий английского языка, он надеется на помощь живущего здесь же родственника, но того якобы по работе срочно вызывают в Европу. В итоге парень оказывается у разбитого корыта.",
        rating:10,
        duration:"1ч 40мин"

    },
    {
        id:2,
        img:aijam,
        title:"Айжамал ",
        janr:"комедия",
        backgrounImg:aijam,
        title2:"Данияр, опытный оперативник и мастер перевоплощения, получает новое задание: внедриться в сеть наркоторговцев под видом существующей девушки по имени Айжамал. Для этого ему придется перевоплотиться, освоить женские манеры и язык жестов, а также завоевать доверие своих новых «коллег».Данияр с головой погружается в новую жизнь, но не все идет гладко. Он влюбляется в Айдай, одну из девушек сети, и ему приходится балансировать между своими чувствами и профессиональным долгом.",
                rating:6.9,
        duration:"1ч 40мин"

    },
    {
        id:3,
        img:inma,
        title:"В Поисках Мамы",
        janr:"драма, комедия, семейный",
        backgrounImg:inma,
        title2:"Азамат растет в детском доме и совершенно ничего не знает о своей семье. Но однажды до него случайно доходит информация о том, что его мама может жить в Америке. Мальчик находит способ отправиться за границу: он выигрывает олимпиаду по математике и получает приглашение. За океан Азамат отправляется с большими надеждами...",
        rating:6.9,
        duration:"1ч 40мин"


    },
    {
        id:4,
        img:poj,
        title:"Пожалей",
        janr:"комедия, драма, триллер",
        backgrounImg:poj,
        title2:"Влюбленная пара готовится к свадьбе. Однако девушка внезапно меняет свое решение и без объяснения причин разрывает отношения. Парень, ошеломленный этим поворотом событий, настойчиво пытается узнать причины. Обиженный и разъяренный, он предпринимает отчаянные шаги, чтобы вернуть девушку любой ценой и сделать ее своей женой.",
                rating:6.9,
        duration:"1ч 40мин"

    },
    {
        id:5,
        img:rez,
        title:"Рецепт счастья",
        janr:"комедия ,мелодрама",
        backgrounImg:rez,
        title2:"Айдар - сын крупного бизнесмена живет с уверенностью, что “в этой жизни все покупается и продается”. У Айдара скоро свадьба - по приказу своего отца он женится на девушке, которую не любит. Чтобы хоть как-то отвлечь себя, он устраивает себе необычный мальчишник- челлендж: куда будет первый же рейс из Бишкека, туда и полетят праздновать. Первым рейсом оказывается Анталия. В Анталии Айдар готов на спор завоевать любую девушку по выбору своих друзей. Но можно ли купить любовь? Это доброе и смешное кино о любви, счастье и своем предназначении.",
        rating:6.9,
        duration:"1ч 40мин"

    },
    {
        id:6,
        img:one,
        title:"Один дома",
        janr:"комедия, драма, мелодрама",
        rating:10,
        backgrounImg:one,
        duration:"1ч 43мин",
        title2:"Американское семейство отправляется из Чикаго в Европу, но в спешке сборов бестолковые родители забывают дома... одного из своих детей. Юное создание, однако, не теряется и демонстрирует чудеса изобретательности. И когда в дом залезают грабители, им приходится не раз пожалеть о встрече с милым крошкой."

    },
    {
        id:7,
        img:chil,
        title:"Дети шпионов: Армагеддон",
        janr:" комедия, приключения, семейное",
        rating:9.6,
        backgrounImg:chil,
        duration:"2ч 50мин",
         releaseDate: "2024-03-15",
         title2:"Дети величайших секретных агентов мира невольно помогают могущественному разработчику игр выпустить компьютерный вирус, который дает ему контроль над всеми технологиями, в результате чего они сами становятся шпионами, чтобы спасти своих родителей и весь мир."

    },
    {
        id:8,
        img:djin,
        title:"Джин",
        janr:"комедия, драма, мелодрама",
        rating:9.6,
        backgrounImg:djin,
        duration:"2ч 50мин",
         releaseDate: "2023-03-15",
         title2:"Джин по имени Флора, запертая более 2 тысяч лет в старинной шкатулке для драгоценностей, случайно призвана на службу Бернардом, вокруг которого рушится вся жизнь..."

    },
    {
        id:9,
        img:джингыл,
        backgrounImg:джингыл,
        title:"Джингл Смеллс",
        janr:"комедия, семейное кино, фэнтези",
        rating: 7.5,
        duration: "1ч 45мин",
        releaseDate: "2025-08-15",
        title2:"Ветеран войны Ник Гутман вынужден устроиться на работу к причудливым приятелям своего отца, которых нанимают для выполнения секретной миссии по уничтожению идеальных подарков в канун Рождества. Но вместо того, чтобы уничтожить все игрушки, Ник принимает тайную личность и становится Робин Гудом праздника."

    },
    {
        id:10,
        img:live,
        title:"Жизнь вверх ногами ",
        janr:"комедия, драма, мелодрама",
        rating: 6.5,
        backgrounImg:live,
        duration: "1ч 45мин",
        releaseDate: "2023-04-10",
        title2:"Лос-Анджелес. Неисключительные герои в исключительных обстоятельствах. Чтобы сохранить дружеские и любовные отношения, им придётся взглянуть в глаза страхам и изгнать ложь из своих жизней."

    },
    {
        id:11,
        img:you,
        title:"Вы сердечно приглашены ",
        janr:"комедия, драма, мелодрама",
        backgrounImg:you,
        title2:"Вы сердечно приглашены – свежий комедийный проект 2025 года. Сюжет закручен вокруг организации свадьбы молодой пары Макса и Риты. Вместе с их свадебным планировщиком зрители узнают все тонкости и сложности подготовки к главному событию в жизни. Находчивый планировщик, неуклюжий жених и перфекционистская невеста создают массу юмористических ситуаций, которые не оставят равнодушным...",
        rating: 8.5,
        duration: "1ч 35мин",
        releaseDate: "2025-03-15"

    },
    {
        id:12,
        img:kas,
        backgrounImg:kas,
        title:"Каскадеры",
        janr:"комедия, драма, мелодрама",
        title2:"Некогда известный каскадёр Колт Сиверс (Райан Гослинг) вынужден вернуться в профессию, чтобы помочь своей бывшей девушке Джоди Морено (Эмили Блант) снять её первый фильм, блокбастер с многомиллионным бюджетом. Ситуация осложняется пропажей главного актёра картины (Аарон Тейлор-Джонсон).",
        rating: 7.5,
        duration: "1ч 45мин",
        releaseDate: "2024-03-15"

    },
    {
        id:13,
        img:pad,
        title:"Приключения Паддингтона 3",
        janr:"комедия, мелодрама",
        backgrounImg:pad,
        title2:"Медвежонок Паддингтон (Бен Уишоу) обустроился в Лондоне, повзрослел и даже получил британский паспорт. Джуди (Мадлен Харрис) готовится поступать в университет и почти не выходит из комнаты. Джонатан (Сэмюэл Джослин) просиживает дни напролёт перед компьютером и придумывает хитрые изобретения, чтобы не вставать со стула и не прерывать игру. У мистера Брауна (Хью Бонневилль) появилась новая американская начальница (Хейли Этвелл), теперь степенному английскому джентльмену нужно привыкать не только рассчитывать риски, но и пускаться в опасные авантюры. Миссис Браун (Эмили Мортимер) расстраивается, что дети выросли и родственники больше не проводят время вместе. Тут приходит неожиданное известие: тётя Люси (Имелда Стонтон) в доме престарелых медведей в Перу совсем затосковала и почти перестала общаться с другими мохнатыми пенсионерами. Брауны в полном составе, а также миссис Бёрд (Джули Уолтерс) отправляются на другой континент, чтобы подбодрить медведицу и отдохнуть всей семьёй.",
        rating: 8.5,
        duration: "1ч 45мин",
        releaseDate: "2024-03-15"

    },
    {
        id:14,
        img:son,
        title:"Соник 3 в кино",
        janr:"комедия, мелодрама",
        backgrounImg:son,
        rating: 8.5,
        duration: "1ч 45мин",
        releaseDate: "2024-03-15",
        title2:"Третья часть приключений ежа Соника и его друзей.Соник (Бен Шварц), Тейлз (Коллин О’Шонесси) и Наклз (Идрис Эльба) вместе с названными родителями Томом (Джеймс Марсден) и Мэдди Ваковски (Тика Самптер) отмечают годовщину прибытия синего ежа на Землю. В то же время некто пробуждает от пятидесятилетнего анабиоза другого гостя из далекого космоса — черного двойника Соника Шэдоу (Киану Ривз). Едва продрав глаза номинальный антагонист начинает сеять хаос в Токио, и секретной организации ГОН требуется помощь разноцветной троицы."

    },
    {
        id:15,
        img:fath,
        title:"Отец года",
        backgrounImg:fath,
        title2:"От арт-дилера Энди Гудрича (Майкл Китон) внезапно уходит молодая жена. Он остаётся один воспитывать своих детей-близнецов и параллельно хочет наладить отношения с взрослой и беременной дочерью Грейс (Мила Кунис).",
        rating: 8.5,
        duration: "1ч 45мин",
        releaseDate: "2024-03-15",
        janr:"комедия, драма, мелодрама"

    },
    {
        id:16,
        img:holop,
        backgrounImg:holop,
        title:"Холоп. Великолепный век",
        janr:"комедия, драма, мелодрама",
        title2:"Турецкая версия комедии «Холоп». Сюжет ремейка расскажет о перевоспитании мажора Мете, избалованного наследника из Стамбула, который попадает в османский город XVI века. ",
        rating: 8.5,
        duration: "1ч 45мин",
        releaseDate: "2024-03-15",


    },
]